УТ_для_edt/src/InformationRegisters/смартИндивидуальныеСкидкиКлиентов/смартИндивидуальныеСкидкиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИндивидуальныеСкидкиКлиентов</name>
  <comment>#1323 смарт: Лопато 15.03.2023 //Восстановить и переделать механизм индивидуальных скидок</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <comment>#1870 смарт: Лопато 24.06.2024 //Доработать механизм выгрузки индивидуальных скидок</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/РасчетыСКлиентами/РасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОплате</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Отгружается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуКлиенту</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродажаПоЗаказу</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <comment>Заполняется для реализации товаров и услуг</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключатьПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗалогЗаТару</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗачетаПоДатеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОплаты</name>
    <type>
      <types>EnumRef.ВариантыОплатыКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/смартОборудованиеЧернилаКлиентов/смартОборудованиеЧернилаКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОборудованиеЧернилаКлиентов</name>
  <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
  <resources>
    <name>Количество</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МотоРесурс</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОборудованиеКлиентов</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СопоставлениеСТоваром</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/РасчетыСКлиентамиПоСрокам/РасчетыСКлиентамиПоСрокам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКлиентамиПоСрокам</name>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Долг</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДолгУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПорядокЗачета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.РегистраторРасчетов</types>
      <types>DocumentRef.РасчетКурсовыхРазниц</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.СписаниеЗадолженности</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСКлиентом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПлановогоПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВозникновения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/СмартСтатусыЗаказовБитрикс/СмартСтатусыЗаказовБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СмартСтатусыЗаказовБитрикс</name>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.смартСтатусыЗаказовБитриксЗначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаМет</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДсайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыАкций/смартСтатусыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыАкций</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <enumValues>
    <name>Подготавливается</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
    <comment>//++ #Б-7532 смарт: Фролов 20.07.2026 //Добавить статус &quot;Завершено&quot; в Управление акциями</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров</name>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВвозИзЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>СДавальцем</name>
  </enumValues>
  <enumValues>
    <name>СПереработчиком</name>
  </enumValues>
  <enumValues>
    <name>СПоклажедателем</name>
  </enumValues>
  <enumValues>
    <name>СХранителем</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартВидыАкций/смартВидыАкций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыАкций</name>
  <comment>//++ #Б4818 смарт: Шляпников 17.11.2025 / Создание механизма учета скидок и акций по оборудованию. </comment>
  <enumValues>
    <name>ДемоЗал</name>
  </enumValues>
  <enumValues>
    <name>Уценка</name>
  </enumValues>
  <enumValues>
    <name>СпецЦена</name>
  </enumValues>
  <enumValues>
    <name>Распродажа</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/CommonModules/смартОбменССайтомБитриксСервер/Module.bsl
#Область Регистрация

Процедура смартПередЗаписьюОбъектаОбменССайтомБитриксПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.Ссылка.Пустая() Тогда
		Источник.ДополнительныеСвойства.Вставить("ЗаписьНовогоОбъекта", Истина);
	Иначе
		
		Если ТипЗнч(Источник) = Тип("СправочникОбъект.Контрагенты") Тогда
			
			Если Источник.Ссылка.Партнер <> Источник.Партнер Тогда
				Источник.ДополнительныеСвойства.Вставить("СменаПартнера", Источник.Ссылка.Партнер);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.КонтактныеЛицаПартнеров") Тогда
			
			Если Источник.Ссылка.Владелец <> Источник.Владелец Тогда
				Источник.ДополнительныеСвойства.Вставить("СменаПартнера", Источник.Ссылка.Владелец);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Партнеры") Тогда
			
			Если Источник.Ссылка.Родитель <> Источник.Родитель Тогда
				Источник.ДополнительныеСвойства.Вставить("СменаПартнера", Источник.Ссылка.Родитель);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура смартПриЗаписиОбъектаОбменССайтомБитриксПриЗаписи(Источник, Отказ) Экспорт
	
	МассивУзлов = смартОбщегоНазначенияСКэш.ПолучитьМассивУзловОбменаБитрикс();
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Контрагенты") Тогда
			
		Если Источник.ДополнительныеСвойства.Свойство("СменаПартнера") Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.ДополнительныеСвойства.СменаПартнера));
		КонецЕсли;
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.Партнер));
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.КонтактныеЛицаПартнеров") Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("СменаПартнера") Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.ДополнительныеСвойства.СменаПартнера));
		КонецЕсли;
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.Владелец));
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Партнеры") Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("СменаПартнера") Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.ДополнительныеСвойства.СменаПартнера));
		КонецЕсли;
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.Ссылка));
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.Партнер));
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.смартУправлениеАкциями") Тогда
		
		Если Источник.Статус = Перечисления.смартСтатусыАкций.Действует И (Источник.ДатаОкончанияАкции = Дата(1, 1, 1) ИЛИ КонецДня(Источник.ДатаОкончанияАкции) >= ТекущаяДата()) Тогда
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Источник.Ссылка);
			
			МассивУсзловБ = Б_ОбменССайтомСервер.ПолучениеОбщегоМассиваУзлов();
			МассивТоваров = Источник.Товары.ВыгрузитьКолонку("Номенклатура");
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУсзловБ, МассивТоваров);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		Если ЗначениеЗаполнено(Источник.Партнер) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(Источник.Партнер));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура смартПриЗаписиРегистраОбменССайтомБитриксПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	МассивУзлов = смартОбщегоНазначенияСКэш.ПолучитьМассивУзловОбменаБитрикс();
	
	Если МассивУзлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.смартИндивидуальныеСкидкиКлиентов") Тогда
		
		ТаблицаПартнеров = Источник.Выгрузить(, "Клиент");
		ТаблицаПартнеров.Свернуть("Клиент");
		
		Для каждого стрПартнер Из ТаблицаПартнеров Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(стрПартнер.Клиент));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентами") Тогда
		
		ТаблицаПартнеров = Новый ТаблицаЗначений;
		ТаблицаПартнеров.Колонки.Добавить("Клиент");
		
		Для каждого стрИсточник Из Источник Цикл
			
			НоваяСтрока = ТаблицаПартнеров.Добавить();
			НоваяСтрока.Клиент = стрИсточник.АналитикаУчетаПоПартнерам.Партнер;
			
		КонецЦикла;
		
		ТаблицаПартнеров.Свернуть("Клиент");
		
		Для каждого стрПартнер Из ТаблицаПартнеров Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ПолучитьПартнераВерхнегоУровня(стрПартнер.Клиент));
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ВыручкаИСебестоимостьПродаж") Тогда
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьМассивУзловОбменаБитрикс() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	смартНастройкиОбменаССайтомБитрикс.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.смартНастройкиОбменаССайтомБитрикс КАК смартНастройкиОбменаССайтомБитрикс
	|ГДЕ
	|	НЕ смартНастройкиОбменаССайтомБитрикс.ПометкаУдаления
	|	И НЕ смартНастройкиОбменаССайтомБитрикс.ЭтотУзел";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область РаботаССущностями

Функция СоздатьСущностьКонтакт(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("id", "");
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("partnerXmlId", "");
	Сущность.Вставить("active", "");
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьКонтрагент(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("partnerXmlId", "");
	Сущность.Вставить("clientType", "");
	Сущность.Вставить("ogrn", "");
	Сущность.Вставить("inn", "");
	Сущность.Вставить("kpp", "");
	Сущность.Вставить("name", "");
	Сущность.Вставить("legalAddress", "");
	Сущность.Вставить("active", "");
	Сущность.Вставить("phone", "");
	Сущность.Вставить("email", "");
	
	Сущность.Вставить("contracts", Новый Массив);
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьПартнер(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("description", "");
	Сущность.Вставить("active", "");
	Сущность.Вставить("mainManagerXmlId", "");
	Сущность.Вставить("serviceCenterManagerXmlId", "");
	Сущность.Вставить("consumablesManagerXmlId", "");
	Сущность.Вставить("discounts", Новый Массив);
	
	Сущность.Вставить("contacts", Новый Массив);
	Сущность.Вставить("contragents", Новый Массив);
	Сущность.Вставить("equipments", Новый Массив);
	Сущность.Вставить("repairs", Новый Массив);
	Сущность.Вставить("mutualSettlements", Новый Массив);
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьИндивидуальнаяСкидка(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("productXmlId", "");
	Сущность.Вставить("discount ", "");
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьМенеджер(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("name", "");
	Сущность.Вставить("phone", "");
	Сущность.Вставить("mobile", "");
	Сущность.Вставить("email", "");
	Сущность.Вставить("active", "");
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьДоговор(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("contragentXmlId", "");
	Сущность.Вставить("contractNumber", "");
	Сущность.Вставить("contractDate", "");
	Сущность.Вставить("contractName", "");
	Сущность.Вставить("startDate", "");
	Сущность.Вставить("endDate", "");
	Сущность.Вставить("active", "");
	Сущность.Вставить("currency", "");
	Сущность.Вставить("amount", "");
	Сущность.Вставить("balance", "");
	Сущность.Вставить("overdraftLimit", "");
	Сущность.Вставить("reservedAmount", "");
	Сущность.Вставить("products", Новый Массив);
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьОборудование(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("partnerXmlId", "");
	Сущность.Вставить("productXmlId", "");
	Сущность.Вставить("serialNumber", "");
	Сущность.Вставить("purchaseDate", "");
	Сущность.Вставить("warrantyEndDate", "");
	Сущность.Вставить("extendedWarrantyStartDate", "");
	Сущность.Вставить("supplierName", "");
	Сущность.Вставить("purchaserName", "");
	Сущность.Вставить("contactPerson", "");
	Сущность.Вставить("shipmentDate", "");
	Сущность.Вставить("address", "");
	Сущность.Вставить("setupRequestNumber", "");
	Сущность.Вставить("notes", "");
	Сущность.Вставить("name", "");
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьРемонт(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("partnerXmlId", "");
	Сущность.Вставить("productXmlId", "");
	Сущность.Вставить("serial", "");
	Сущность.Вставить("number", "");
	Сущность.Вставить("date", "");
	Сущность.Вставить("engeneer", "");
	Сущность.Вставить("phone", "");
	Сущность.Вставить("status", "");
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьВзаиморасчеты(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("contragentXmlId", "");
	Сущность.Вставить("contractXmlId", "");
	Сущность.Вставить("balanceDebit", "");
	Сущность.Вставить("balanceCredit", "");
	Сущность.Вставить("currency", "");
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьСтрокаНоменклатуры(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("productXmlId", "");
	Сущность.Вставить("quantity", "");
	Сущность.Вставить("unitPrice", "");
	Сущность.Вставить("totalPrice", "");
	Сущность.Вставить("sort", "");
	
	Возврат Сущность;
	
КонецФункции

Функция СоздатьСущностьАкция(Версия = 1) Экспорт
	
	Сущность = Новый Структура;
	Сущность.Вставить("xmlId", "");
	Сущность.Вставить("type", "");
	Сущность.Вставить("productXmlId", "");
	Сущность.Вставить("price", "");
	Сущность.Вставить("dateStart", "");
	Сущность.Вставить("dateEnd", "");
	Сущность.Вставить("active", "");
	Сущность.Вставить("demoHall", "");
	Сущность.Вставить("serialNumber", "");
	Сущность.Вставить("yearOfManufacture", "");
	Сущность.Вставить("demoStartDate", "");
	Сущность.Вставить("mileage", "");
	Сущность.Вставить("note", "");
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьКонтактПоКонтактномуЛицу(Сущность, КонтактноеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.смартИдентификаторБитрикс КАК смартИдентификаторБитрикс,
	|	КонтактныеЛицаПартнеров.смартАктивностьНаСайте КАК смартАктивностьНаСайте,
	|	КонтактныеЛицаПартнеров.Владелец КАК Партнер,
	|	КонтактныеЛицаПартнеров.Владелец.Родитель КАК ПартнерРодитель,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КонтактныеЛицаПартнеров.Ссылка) КАК Идентификатор,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КонтактныеЛицаПартнеров.Владелец) КАК ИдентификаторПартнера
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|ГДЕ
	|	КонтактныеЛицаПартнеров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Сущность.id = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Выборка.смартИдентификаторБитрикс);
		Сущность.xmlId = СокрЛП(Выборка.Идентификатор);
		Если НЕ ЗначениеЗаполнено(Выборка.ПартнерРодитель) Тогда
			Сущность.partnerXmlId = СокрЛП(Выборка.Партнер.УникальныйИдентификатор());
		Иначе
			Сущность.partnerXmlId = СокрЛП(ПолучитьПартнераВерхнегоУровня(Выборка.ПартнерРодитель).УникальныйИдентификатор());
		КонецЕсли;
		Сущность.active = ?(Выборка.смартАктивностьНаСайте, "Y", "N");
		
	КонецЕсли;
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьКонтрагентПоКонтрагенту(Сущность, Контрагент, ДанныеДляВыгрузки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка) КАК xmlId,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Партнер) КАК partnerXmlId,
	|	Контрагенты.Партнер.Родитель КАК ПартнерРодитель,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	Контрагенты.КонтактнаяИнформация.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Тип КАК Тип,
	|		Вид КАК Вид,
	|		Представление КАК Представление,
	|		ЗначенияПолей КАК ЗначенияПолей,
	|		Страна КАК Страна,
	|		Регион КАК Регион,
	|		Город КАК Город,
	|		АдресЭП КАК АдресЭП,
	|		ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|		НомерТелефона КАК НомерТелефона,
	|		НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|		ВидДляСписка КАК ВидДляСписка,
	|		ДействуетС КАК ДействуетС,
	|		Значение КАК Значение
	|	) КАК КонтактнаяИнформация,
	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Сущность.xmlId = СокрЛП(Выборка.xmlId);
		Если НЕ ЗначениеЗаполнено(Выборка.ПартнерРодитель) Тогда
			Сущность.partnerXmlId = СокрЛП(Выборка.partnerXmlId);
		Иначе
			Сущность.partnerXmlId = СокрЛП(ПолучитьПартнераВерхнегоУровня(Выборка.ПартнерРодитель).УникальныйИдентификатор());
		КонецЕсли;
		
		Если Выборка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Сущность.clientType = "ИП";
		ИначеЕсли Выборка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			Сущность.clientType = "Физическое лицо";
		ИначеЕсли Выборка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Сущность.clientType = "Юридическое лицо";
		Иначе
			Сущность.clientType = СокрЛП(Выборка.ЮридическоеФизическоеЛицо);
		КонецЕсли;
		
		Сущность.ogrn = "";
		Сущность.inn = СокрЛП(Выборка.ИНН);
		Сущность.kpp = СокрЛП(Выборка.КПП);
		Сущность.name = СокрЛП(Выборка.НаименованиеПолное);
		Сущность.active = "Y";
		
		ВыборкаКонтакт = Выборка.КонтактнаяИнформация.Выбрать();
		Пока ВыборкаКонтакт.Следующий() Цикл
			
			Если ВыборкаКонтакт.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты И ЗначениеЗаполнено(ВыборкаКонтакт.АдресЭП) Тогда
				Сущность.email = ВыборкаКонтакт.АдресЭП;
			ИначеЕсли ВыборкаКонтакт.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон И ЗначениеЗаполнено(ВыборкаКонтакт.НомерТелефона) Тогда
				Сущность.phone = ВыборкаКонтакт.НомерТелефона;
			ИначеЕсли ВыборкаКонтакт.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента И ЗначениеЗаполнено(ВыборкаКонтакт.Представление) Тогда
				Сущность.legalAddress = ВыборкаКонтакт.Представление;
			КонецЕсли;
			
		КонецЦикла;
		
		//договоры
		НайденныеСтроки = ДанныеДляВыгрузки.Договоры.НайтиСтроки(Новый Структура("Партнер,Контрагент", Контрагент.Партнер, Контрагент));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			
			СущностьДоговор = СоздатьСущностьДоговор();
			ЗаполнитьСущностьДоговорПоДоговору(СущностьДоговор, стрНайденныеСтроки.Договор);
			Сущность.contracts.Добавить(СущностьДоговор);
			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьПартнерПоПартнеру(СущностьПартнер, Партнер, ДанныеДляВыгрузки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Партнеры.Ссылка) КАК Ссылка,
	|	Партнеры.Наименование КАК Наименование,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Партнеры.смартМенеджерПоРасходнымМатериалам) КАК consumablesManagerXmlId,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Партнеры.смартОсновнойМенеджерСервисЦентра) КАК serviceCenterManagerXmlId,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Партнеры.ОсновнойМенеджер) КАК mainManagerXmlId
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(смартИндивидуальныеСкидкиКлиентовСрезПоследних.Номенклатура) КАК productXmlId,
	|	смартИндивидуальныеСкидкиКлиентовСрезПоследних.ПроцентСкидки КАК discount
	|ИЗ
	|	РегистрСведений.смартИндивидуальныеСкидкиКлиентов.СрезПоследних(, Клиент = &Ссылка) КАК смартИндивидуальныеСкидкиКлиентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Партнер);
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СущностьПартнер.xmlId = СокрЛП(Выборка.Ссылка);
		СущностьПартнер.description = СокрЛП(Выборка.Наименование);
		СущностьПартнер.active = "Y";
		СущностьПартнер.mainManagerXmlId = СокрЛП(Выборка.mainManagerXmlId);
		СущностьПартнер.serviceCenterManagerXmlId = СокрЛП(Выборка.serviceCenterManagerXmlId);
		СущностьПартнер.consumablesManagerXmlId = СокрЛП(Выборка.consumablesManagerXmlId);
		
		ВыборкаСкидок = Пакет[1].Выбрать();
		Пока ВыборкаСкидок.Следующий() Цикл
			
			СущностьСкидка = СоздатьСущностьИндивидуальнаяСкидка();
			СущностьСкидка.productXmlId = СокрЛП(ВыборкаСкидок.productXmlId);
			СущностьСкидка.discount = ВыборкаСкидок.discount;
			СущностьПартнер.discounts.Добавить(СущностьСкидка);
			
		КонецЦикла;
		
		//контактные лица
		НайденныеСтроки = ДанныеДляВыгрузки.КонтактныеЛица.НайтиСтроки(Новый Структура("Партнер", Партнер));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			
			Сущность = СоздатьСущностьКонтакт();
			ЗаполнитьСущностьКонтактПоКонтактномуЛицу(Сущность, стрНайденныеСтроки.КонтактноеЛицо);
			СущностьПартнер.contacts.Добавить(Сущность);
			
		КонецЦикла;
		
		//контрагенты
		НайденныеСтроки = ДанныеДляВыгрузки.Контрагенты.НайтиСтроки(Новый Структура("Партнер", Партнер));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			
			Сущность = СоздатьСущностьКонтрагент();
			ЗаполнитьСущностьКонтрагентПоКонтрагенту(Сущность, стрНайденныеСтроки.Контрагент, ДанныеДляВыгрузки);
			СущностьПартнер.contragents.Добавить(Сущность);
			
		КонецЦикла;
		
		//оборудование
		НайденныеСтроки = ДанныеДляВыгрузки.Оборудование.НайтиСтроки(Новый Структура("Партнер", Партнер));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			
			Сущность = СоздатьСущностьОборудование();
			ЗаполнитьСущностьОборудованиеПоОборудованию(Сущность, стрНайденныеСтроки);
			СущностьПартнер.equipments.Добавить(Сущность);
			
		КонецЦикла;
		
		//заявки на ремонт
		НайденныеСтроки = ДанныеДляВыгрузки.ЗаявкиНаРемонт.НайтиСтроки(Новый Структура("ПартнерВыгрузки", Партнер));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			
			Сущность = СоздатьСущностьРемонт();
			ЗаполнитьСущностьРемонтПоСтрокеВыгрузки(Сущность, стрНайденныеСтроки);
			СущностьПартнер.repairs.Добавить(Сущность);
			
		КонецЦикла;
		
		//взаиморасчеты
		НайденныеСтроки = ДанныеДляВыгрузки.Взаиморасчеты.НайтиСтроки(Новый Структура("Партнер", Партнер));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			
			Сущность = СоздатьСущностьВзаиморасчеты();
			ЗаполнитьСущностьВзаиморасчеты(Сущность, стрНайденныеСтроки);
			СущностьПартнер.mutualSettlements.Добавить(Сущность);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СущностьПартнер;
	
КонецФункции

Функция ЗаполнитьСущностьМенеджерПоПользователю(Сущность, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК xmlId,
	|	Пользователи.Наименование КАК Наименование,
	|	Пользователи.КонтактнаяИнформация.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Тип КАК Тип,
	|		Вид КАК Вид,
	|		Представление КАК Представление,
	|		ЗначенияПолей КАК ЗначенияПолей,
	|		Страна КАК Страна,
	|		Регион КАК Регион,
	|		Город КАК Город,
	|		АдресЭП КАК АдресЭП,
	|		ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	|		НомерТелефона КАК НомерТелефона,
	|		НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	|		ВидДляСписка КАК ВидДляСписка,
	|		Значение КАК Значение
	|	) КАК КонтактнаяИнформация,
	|	Пользователи.смартРабочаяПочта КАК смартРабочаяПочта,
	|	Пользователи.смартРабочийТелефон КАК смартРабочийТелефон,
	|	Пользователи.Недействителен КАК Недействителен
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Сущность.xmlId = СокрЛП(Выборка.xmlId);
		Сущность.name = СокрЛП(Выборка.Наименование);
		Сущность.active = ?(Выборка.Недействителен, "N", "Y");
		Сущность.email = СокрЛП(Выборка.смартРабочаяПочта);
		
		ВыборкаКонтакт = Выборка.КонтактнаяИнформация.Выбрать();
		Пока ВыборкаКонтакт.Следующий() Цикл
			
			Если ВыборкаКонтакт.Вид = Справочники.ВидыКонтактнойИнформации.CRM_МобильныйТелефонПользователя Тогда
				Сущность.mobile = ВыборкаКонтакт.НомерТелефона;
			ИначеЕсли ВыборкаКонтакт.Вид = Справочники.ВидыКонтактнойИнформации.смартРабочийТелефон Тогда
				Сущность.phone = СтрШаблон("+7 (495) 663-91-11 (доб. %1)", ВыборкаКонтакт.НомерТелефона);
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьДоговорПоДоговору(Сущность, Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагентов.Ссылка) КАК ИДДоговора,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагентов.Контрагент) КАК ИДКонтрагента,
	|	ДоговорыКонтрагентов.Номер КАК Номер,
	|	ДоговорыКонтрагентов.Дата КАК Дата,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ДоговорыКонтрагентов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ДоговорыКонтрагентов.Статус КАК Статус,
	|	ПРЕДСТАВЛЕНИЕ(ДоговорыКонтрагентов.ВалютаВзаиморасчетов) КАК Валюта,
	|	ДоговорыКонтрагентов.Сумма КАК Сумма,
	|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК Баланс,
	|	ДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Остатки(, АналитикаУчетаПоПартнерам.Договор = &Ссылка) КАК РасчетыСКлиентамиОстатки
	|		ПО ДоговорыКонтрагентов.Ссылка = РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Договор
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентовсмартОборудование.ОборудованиеКлиента КАК ОборудованиеКлиента,
	|	ДоговорыКонтрагентовсмартОборудование.Серия КАК Серия,
	|	ДоговорыКонтрагентовсмартОборудование.Бренд КАК Бренд,
	|	смартОборудованиеЧернилаКлиентов.Номенклатура КАК Номенклатура,
	|	смартОборудованиеЧернилаКлиентов.Количество КАК Количество,
	|	ДоговорыКонтрагентовсмартОборудование.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.смартОборудование КАК ДоговорыКонтрагентовсмартОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартОборудованиеЧернилаКлиентов КАК смартОборудованиеЧернилаКлиентов
	|		ПО ДоговорыКонтрагентовсмартОборудование.ОборудованиеКлиента = смартОборудованиеЧернилаКлиентов.ОборудованиеКлиентов
	|			И (смартОборудованиеЧернилаКлиентов.СопоставлениеСТоваром)
	|ГДЕ
	|	ДоговорыКонтрагентовсмартОборудование.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если НЕ Выборка.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.Номер)
			ИЛИ НЕ ЗначениеЗаполнено(Выборка.Дата) Тогда
			
			Возврат Сущность;
			
		КонецЕсли;
		
		Сущность.xmlId = СокрЛП(Выборка.ИДДоговора);
		Сущность.contragentXmlId = СокрЛП(Выборка.ИДКонтрагента);
		Сущность.contractNumber = Выборка.Номер;
		Сущность.contractDate = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Сущность.contractName = Выборка.Наименование;
		Сущность.startDate = Формат(Выборка.ДатаНачалаДействия, "ДФ=dd.MM.yyyy");
		Сущность.endDate = Формат(Выборка.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy");
		Сущность.active = ?(Выборка.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует, "Y", "N");
		Сущность.currency = Выборка.Валюта;
		Сущность.amount = Выборка.Сумма;
		Сущность.balance = Выборка.Баланс;
		Сущность.overdraftLimit = 0;
		Сущность.reservedAmount = 0;
		
		ВыборкаНоменклатура = Пакет[1].Выбрать();
		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			СущностьСтрокаНоменклатуры = СоздатьСущностьСтрокаНоменклатуры();
			Сущность.products.Добавить(ЗаполнитьСущностьСтрокаНоменклатурыПоОборудованию(СущностьСтрокаНоменклатуры, ВыборкаНоменклатура));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьСтрокаНоменклатурыПоОборудованию(Сущность, СтрокаОборудования) Экспорт

	Сущность.productXmlId = СокрЛП(СтрокаОборудования.Номенклатура.УникальныйИдентификатор());
	Сущность.quantity = 1;
	Сущность.unitPrice = 0;
	Сущность.totalPrice = 0;
	Сущность.sort = СтрокаОборудования.НомерСтроки;
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьОборудованиеПоОборудованию(Сущность, Оборудование) Экспорт
	
	ДатаГарантии1 = Неопределено;
	ДатаГарантии2 = Неопределено;
	ФорматДаты = "ДФ=dd.MM.yyyy";
	
	Если НЕ Оборудование.Оборудование = NULL И ЗначениеЗаполнено(Оборудование.Оборудование) Тогда
		Сущность.xmlId = СокрЛП(Оборудование.Оборудование.УникальныйИдентификатор());
		Сущность.name = СокрЛП(Оборудование.Оборудование);
	КонецЕсли;
	
	Если НЕ Оборудование.Партнер = NULL И ЗначениеЗаполнено(Оборудование.Партнер) Тогда
		Сущность.partnerXmlId = СокрЛП(ПолучитьПартнераВерхнегоУровня(Оборудование.Партнер).УникальныйИдентификатор());
	КонецЕсли;
	
	Если НЕ Оборудование.Номенклатура = NULL И ЗначениеЗаполнено(Оборудование.Номенклатура) Тогда
		Сущность.productXmlId = СокрЛП(Оборудование.Номенклатура.УникальныйИдентификатор());
	КонецЕсли;
	
	Если НЕ Оборудование.Серия = NULL И ЗначениеЗаполнено(Оборудование.Серия) Тогда
		Сущность.Вставить("serialNumber", СокрЛП(Оборудование.Серия.Номер));
	КонецЕсли;
	
	Если НЕ Оборудование.ДатаНачалаДополнительнойГарантии = NULL И ЗначениеЗаполнено(Оборудование.ДатаНачалаДополнительнойГарантии) Тогда
		Сущность.Вставить("extendedWarrantyStartDate", Формат(Оборудование.ДатаНачалаДополнительнойГарантии, ФорматДаты));
	КонецЕсли;
	
	Если НЕ Оборудование.ДатаОтгрузки = NULL И ЗначениеЗаполнено(Оборудование.ДатаОтгрузки) Тогда
		
		Сущность.Вставить("purchaseDate", Формат(Оборудование.ДатаОтгрузки, ФорматДаты));
		ДатаГарантии1 = ДобавитьМесяц(Оборудование.ДатаОтгрузки, 13);
		
	КонецЕсли;
	
	Если НЕ Оборудование.АдресВыезда = NULL И ЗначениеЗаполнено(Оборудование.АдресВыезда) Тогда
		Сущность.Вставить("address", СокрЛП(Оборудование.АдресВыезда));
	КонецЕсли;
	
	Если НЕ Оборудование.ПНР = NULL И ЗначениеЗаполнено(Оборудование.ПНР) Тогда
		Сущность.Вставить("setupRequestNumber", СокрЛП(Оборудование.ПНР.Номер));
	КонецЕсли;
	
	Если НЕ Оборудование.Комментарий = NULL И ЗначениеЗаполнено(Оборудование.Комментарий) Тогда
		Сущность.Вставить("notes", СокрЛП(Оборудование.Комментарий));
	КонецЕсли;
	
	Если НЕ Оборудование.ДатаПодписанияАктаПНР = NULL И ЗначениеЗаполнено(Оборудование.ДатаПодписанияАктаПНР) Тогда
		ДатаГарантии2 = ДобавитьМесяц(Оборудование.ДатаПодписанияАктаПНР, 12);
		Сущность.Вставить("shipmentDate", Формат(Оборудование.ДатаПодписанияАктаПНР, ФорматДаты));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаГарантии1) И ЗначениеЗаполнено(ДатаГарантии2) Тогда
		ДатаГарантии = Мин(ДатаГарантии1, ДатаГарантии2);
	ИначеЕсли ЗначениеЗаполнено(ДатаГарантии1) Тогда
		ДатаГарантии = ДатаГарантии1;
	ИначеЕсли ЗначениеЗаполнено(ДатаГарантии2) Тогда
		ДатаГарантии = ДатаГарантии2;
	Иначе
		ДатаГарантии = Дата(1, 1, 1);
	КонецЕсли;
	
	Сущность.Вставить("warrantyEndDate", ?(ЗначениеЗаполнено(ДатаГарантии), Формат(ДатаГарантии, ФорматДаты), ""));
	
	Сущность.Вставить("supplierName", СокрЛП(Оборудование.ПНР.Организация.НаименованиеСокращенное));
	Сущность.Вставить("purchaserName", СокрЛП(Оборудование.ПНР.Контрагент));
	Если Оборудование.ПНР.КонтактныеЛица.Количество() > 0 Тогда
		Сущность.Вставить("contactPerson", СокрЛП(Оборудование.ПНР.КонтактныеЛица[0].КонтактноеЛицо));
	КонецЕсли;
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьРемонтПоСтрокеВыгрузки(Сущность, СтрокаДанных) Экспорт
	
	Если ЗначениеЗаполнено(СтрокаДанных.ОборудованиеКлиентов) Тогда
		Сущность.xmlId = СокрЛП(СтрокаДанных.ОборудованиеКлиентов.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.Партнер) Тогда
		Сущность.partnerXmlId = СокрЛП(ПолучитьПартнераВерхнегоУровня(СтрокаДанных.Партнер).УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.Номенклатура) Тогда
		Сущность.productXmlId = СокрЛП(СтрокаДанных.Номенклатура.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.Серия) Тогда
		Сущность.serial = СокрЛП(СтрокаДанных.Серия.Номер);
	КонецЕсли;
	
	Сущность.number = СокрЛП(СтрокаДанных.Номер);
	Сущность.date = Формат(СтрокаДанных.Дата, "ДФ=yyyy-MM-dd HH:mm:ss");
	Сущность.engeneer = СокрЛП(СтрокаДанных.ИнженерНаименование);
	Сущность.phone = СокрЛП(СтрокаДанных.ТелефонИнженера);
	Сущность.status = СокрЛП(СтрокаДанных.СтатусПредставление);
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьВзаиморасчеты(Сущность, Данные) Экспорт
	
	Сущность.contragentXmlId = СокрЛП(Данные.Контрагент.УникальныйИдентификатор());
	Если ЗначениеЗаполнено(Данные.Договор) Тогда
		Сущность.contractXmlId = СокрЛП(Данные.Договор.УникальныйИдентификатор());
	КонецЕсли;
	Сущность.balanceDebit = Данные.Аванс;
	Сущность.balanceCredit = Данные.Долг;
	Сущность.currency = СокрЛП(Данные.Валюта);
	
	Возврат Сущность;
	
КонецФункции

Функция ЗаполнитьСущностьАкция(Сущность, Данные) Экспорт
	
	ИДНоменклатура = "";
	ИДСерия = "";
	ИДСклад = "";
	
	Если ЗначениеЗаполнено(Данные.Номенклатура) Тогда
		ИДНоменклатура = СокрЛП(Данные.Номенклатура.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Серия) Тогда
		ИДСерия = СокрЛП(Данные.Серия.УникальныйИдентификатор());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Склад) Тогда
		ИДСклад = СокрЛП(Данные.Склад.УникальныйИдентификатор());
	КонецЕсли;
	
	Если Данные.ВидАкции = Перечисления.смартВидыАкций.ДемоЗал Тогда
		ИДПродукта = СтрШаблон("%1^%2^%3", ИДНоменклатура, ИДСклад, ИДСерия);
	Иначе
		ИДПродукта = ИДНоменклатура;
	КонецЕсли;
	
	Сущность.xmlId = СокрЛП(Данные.Ссылка.УникальныйИдентификатор());
	Сущность.type = "sale";
	Сущность.productXmlId = ИДПродукта;
	Сущность.price = Окр(РаботаСКурсамиВалют.ПересчитатьВВалюту(Данные.ЦенаАкция, Данные.ВалютаАкция, смартОбщегоНазначенияСКэш.ВалютаРегламентированногоУчета(), ТекущаяДата()));
	Сущность.dateStart = Формат(Данные.ДатаНачалаАкции, "ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
	Сущность.dateEnd = Формат(?(ЗначениеЗаполнено(Данные.ДатаОкончанияАкции), Данные.ДатаОкончанияАкции, Дата(3999, 12, 31)), "ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
	Сущность.active = "Y";
	Сущность.demoHall = СокрЛП(Данные.Склад);
	Сущность.serialNumber = СокрЛП(Данные.Серия);
	Сущность.yearOfManufacture = Формат(Данные.ОборудованиеДемозала.ГодВыпуска, "ДФ=yyyy");;
	Сущность.demoStartDate = Формат(Данные.ОборудованиеДемозала.ДатаЗапуска, "ДФ='yyyy-MM-dd ЧЧ:мм:сс'");
	Сущность.mileage = Данные.ОборудованиеДемозала.ПробегОборудования;
	Сущность.note = СокрЛП(Данные.Примечание);
	
	Возврат Сущность;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаДанных

Функция ПередатьПакетВБитрикс(Узел, Данные, ТипПакета, ДанныеВыгрузки)
	
	ДанныеПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Узел, "АдресСайта,Логин,Пароль");
	
	Если ТипПакета = "Пользователи" Тогда
		АдресВнутри = "rest-api/v1/partners/managers/";
	ИначеЕсли ТипПакета = "Партнеры" Тогда
		АдресВнутри = "rest-api/v1/sync/full/";
	ИначеЕсли ТипПакета = "Акции" Тогда
		АдресВнутри = "rest-api/v1/promotions/sync/";
	Иначе
		Возврат "Неизвестный вид пакета данных";
	КонецЕсли;
	
	МассивСущностей = Новый Массив;
	Для каждого стрДанные Из Данные Цикл
		
		Если НЕ ЗначениеЗаполнено(стрДанные) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипПакета = "Пользователи" Тогда
			
			Сущность = СоздатьСущностьМенеджер();
			ЗаполнитьСущностьМенеджерПоПользователю(Сущность, стрДанные);
			
		ИначеЕсли ТипПакета = "Партнеры" Тогда
			
			Сущность = СоздатьСущностьПартнер();
			ЗаполнитьСущностьПартнерПоПартнеру(Сущность, стрДанные, ДанныеВыгрузки);
			
		ИначеЕсли ТипПакета = "Акции" Тогда
			
			Сущность = СоздатьСущностьАкция();
			ЗаполнитьСущностьАкция(Сущность, стрДанные);
			
		КонецЕсли;
		
		МассивСущностей.Добавить(Сущность);
		
	КонецЦикла;
	
	Если ТипПакета = "Партнеры" Тогда
		ДанныеJSON = смартОбщегоНазначения.ЗначениеВJSON(Новый Структура("partners", МассивСущностей));
	ИначеЕсли ТипПакета = "Акции" Тогда
		ДанныеJSON = смартОбщегоНазначения.ЗначениеВJSON(МассивСущностей);
	Иначе
		ДанныеJSON = смартОбщегоНазначения.ЗначениеВJSON(Новый Структура("data", МассивСущностей));
	КонецЕсли;
	
	Сообщить(АдресВнутри);
	Сообщить(ДанныеJSON);
		
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type",  "application/json");
	
	Результат = смартИнтеграцияDaData.ВыполнитьPOSTЗапрос(ДанныеПодключения.АдресСайта, АдресВнутри, 443, ДанныеПодключения.Логин, ДанныеПодключения.Пароль,,, Новый ЗащищенноеСоединениеOpenSSL(), Заголовки, ДанныеJSON);
	
	Если Результат <> Неопределено И НЕ Результат.КодСостояния = 200 Тогда
		Возврат Результат.ПолучитьТелоКакСтроку();
	Иначе
		ДанныеОтвета = смартОбщегоНазначения.JSONВЗначение(Результат.ПолучитьТелоКакСтроку(),, Ложь);
		Если ВРЕГ(ДанныеОтвета.status) = "ERROR" Тогда
			Возврат смартОбщегоНазначения.ЗначениеВJSON(ДанныеОтвета.errors);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СформироватьДанныеДляВыгрузкиВБитрикс(МассивПартнеров, Узел)
	
	Результат = Новый Структура("Партнеры,КонтактныеЛица,Пользователи,Контрагенты,Договоры,Оборудование,Взаиморасчеты,ЗаявкиНаРемонт");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Партнеры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТПартнеры
	|ИЗ
	|	Справочник.Партнеры КАК Партнеры
	|ГДЕ
	|	Партнеры.Ссылка В ИЕРАРХИИ(&МассивПартнеров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ВТПартнеры.Ссылка КАК Партнер
	|ПОМЕСТИТЬ ВТКонтрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартнеры КАК ВТПартнеры
	|		ПО Контрагенты.Партнер = ВТПартнеры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	|	СУММА(-ЕСТЬNULL(РасчетыСКлиентамиОстатки.ДолгОстаток, 0)) КАК Долг,
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиОстатки.ПредоплатаОстаток, 0)) КАК Аванс,
	|	РасчетыСКлиентамиОстатки.Валюта КАК Валюта
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам.Партнер В
	|					(ВЫБРАТЬ
	|						Т.Ссылка
	|					ИЗ
	|						ВТПартнеры КАК Т)
	|				И АналитикаУчетаПоПартнерам.Контрагент В
	|					(ВЫБРАТЬ
	|						Т.Контрагент
	|					ИЗ
	|						ВТКонтрагенты КАК Т)
	|				И АналитикаУчетаПоПартнерам.Организация = &ОрганизацияСмарт
	|				И (АналитикаУчетаПоПартнерам.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыМеждуОрганизациями.ПустаяСсылка)
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор = НЕОПРЕДЕЛЕНО
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор.смартДоговорПодписан)) КАК РасчетыСКлиентамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Договор,
	|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Партнер,
	|	РасчетыСКлиентамиОстатки.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОборудования.ОборудованиеКлиентов КАК Оборудование,
	|	ВТПартнеры.Ссылка КАК Партнер,
	|	ТабОборудования.Оборудование КАК Номенклатура,
	|	ТабОборудования.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТабОборудования.Серия КАК Серия,
	|	ТабОборудования.ДатаНачалаДополнительнойГарантии КАК ДатаНачалаДополнительнойГарантии,
	|	ТабОборудования.Ссылка.АдресВыезда КАК АдресВыезда,
	|	ТабОборудования.ГарантийныйСрокНаОборудование КАК ГарантийныйСрокНаОборудование,
	|	ТабОборудования.Ссылка.Комментарий КАК Комментарий,
	|	ТабОборудования.ДатаПодписанияАктаНаПНР КАК ДатаПодписанияАктаПНР,
	|	ТабОборудования.Ссылка КАК ПНР
	|ИЗ
	|	ВТПартнеры КАК ВТПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК ТабОборудования
	|		ПО ВТПартнеры.Ссылка = ТабОборудования.Ссылка.Партнер
	|			И (ТабОборудования.Ссылка.Проведен)
	|ГДЕ
	|	НЕ ТабОборудования.ОборудованиеКлиентов = ЗНАЧЕНИЕ(Справочник.смартОборудованиеКлиентов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Партнер КАК Партнер,
	|	ВТКонтрагенты.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКонтрагенты КАК ВТКонтрагенты
	|		ПО ДоговорыКонтрагентов.Контрагент = ВТКонтрагенты.Контрагент
	|			И ДоговорыКонтрагентов.Партнер = ВТКонтрагенты.Партнер
	|ГДЕ
	|	ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	И НЕ ДоговорыКонтрагентов.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ДоговорыКонтрагентов.Номер = """"
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.смартДоговорПодписан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПартнеры.Ссылка.ОсновнойМенеджер КАК Менеджер
	|ИЗ
	|	ВТПартнеры КАК ВТПартнеры
	|ГДЕ
	|	НЕ ВТПартнеры.Ссылка.ОсновнойМенеджер.Недействителен
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПартнеры.Ссылка.смартОсновнойМенеджерСервисЦентра
	|ИЗ
	|	ВТПартнеры КАК ВТПартнеры
	|ГДЕ
	|	НЕ ВТПартнеры.Ссылка.смартОсновнойМенеджерСервисЦентра.Недействителен
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПартнеры.Ссылка.смартМенеджерПоРасходнымМатериалам
	|ИЗ
	|	ВТПартнеры КАК ВТПартнеры
	|ГДЕ
	|	НЕ ВТПартнеры.Ссылка.смартМенеджерПоРасходнымМатериалам.Недействителен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКонтрагенты.Контрагент КАК Контрагент,
	|	ВТКонтрагенты.Партнер КАК Партнер
	|ИЗ
	|	ВТКонтрагенты КАК ВТКонтрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактныеЛицаПартнеров.Ссылка КАК КонтактноеЛицо,
	|	ВТПартнеры.Ссылка КАК Партнер
	|ИЗ
	|	ВТПартнеры КАК ВТПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|		ПО ВТПартнеры.Ссылка = КонтактныеЛицаПартнеров.Владелец
	|ГДЕ
	|	НЕ КонтактныеЛицаПартнеров.смартИдентификаторБитрикс = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.Партнер КАК Партнер,
	|	Заявки.Номер КАК Номер,
	|	Заявки.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(Заявки.Статус) КАК СтатусПредставление,
	|	ТабОборудования.ОборудованиеКлиентов КАК ОборудованиеКлиентов,
	|	ТабОборудования.Оборудование КАК Номенклатура,
	|	ТабОборудования.Серия КАК Серия,
	|	ЕСТЬNULL(Заявки.НазначенныйНаРемонтИнженер.Наименование, """") КАК ИнженерНаименование,
	|	ЕСТЬNULL(Заявки.НазначенныйНаРемонтИнженер.смартРабочийТелефон, """") КАК ТелефонИнженера
	|ИЗ
	|	Документ.смартЗаявкаНаРемонтныеРаботы КАК Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПартнеры КАК ВТПартнеры
	|		ПО Заявки.Партнер = ВТПартнеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаРемонтныеРаботы.Оборудование КАК ТабОборудования
	|		ПО Заявки.Ссылка = ТабОборудования.Ссылка
	|			И (ТабОборудования.НомерСтроки = 1)
	|ГДЕ
	|	НЕ Заявки.ПометкаУдаления
	|	И НЕ Заявки.Статус В (&ТерминальныеСтатусы)
	|	И НЕ Заявки.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";
	
	ТерминальныеСтатусы = Новый Массив;
	ТерминальныеСтатусы.Добавить(Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен);
	ТерминальныеСтатусы.Добавить(Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтОсуществленПоТелефону);
	ТерминальныеСтатусы.Добавить(Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ЗаявкаАннулирована);
	ТерминальныеСтатусы.Добавить(Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ОшибочнаяЗаявка);
	
	Запрос.УстановитьПараметр("МассивПартнеров", МассивПартнеров);
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.смартПредопределенныеЗначения.ВидНоменклатурыТоварПлоттерыСерии.Значение);
	Запрос.УстановитьПараметр("ОрганизацияСмарт", Справочники.смартПредопределенныеЗначения.ОрганизацияБитрикс.Значение);
	Запрос.УстановитьПараметр("ТерминальныеСтатусы", ТерминальныеСтатусы);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТаблицаЗаявок = Пакет[Пакет.Количество() - 1].Выгрузить();
	ТаблицаЗаявок.Колонки.Добавить("ПартнерВыгрузки");
	Для каждого стрЗаявка Из ТаблицаЗаявок Цикл
		Если ЗначениеЗаполнено(стрЗаявка.Партнер) Тогда
			стрЗаявка.ПартнерВыгрузки = ПолучитьПартнераВерхнегоУровня(стрЗаявка.Партнер);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Партнеры = МассивПартнеров;
	Результат.ЗаявкиНаРемонт = ТаблицаЗаявок;
	Результат.КонтактныеЛица = Пакет[Пакет.Количество() - 2].Выгрузить();
	Результат.Контрагенты = Пакет[Пакет.Количество() - 3].Выгрузить();
	Результат.Пользователи = Пакет[Пакет.Количество() - 4].Выгрузить().ВыгрузитьКолонку("Менеджер");
	Результат.Договоры = Пакет[Пакет.Количество() - 5].Выгрузить();
	Результат.Оборудование = Пакет[Пакет.Количество() - 6].Выгрузить();
	Результат.Взаиморасчеты = Пакет[Пакет.Количество() - 7].Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Процедура ВыгрузитьДанныеВБитрикс() Экспорт
	
	МассивУзлов = смартОбщегоНазначенияСКэш.ПолучитьМассивУзловОбменаБитрикс();
	МассивПартнеров = Новый Массив;
	МассивАкций = Новый Массив;
	
	Для каждого Узел Из МассивУзлов Цикл
		
		КоличествоВВыгрузке = Узел.КоличествоПартнеровВПакете;
		Если КоличествоВВыгрузке = 0 Тогда
			КоличествоВВыгрузке = 10;
		КонецЕсли;
		
		Выборка = ПланыОбмена.ВыбратьИзменения(Узел, Узел.НомерОтправленного + 1);
		Пока Выборка.Следующий() Цикл
			
			ТекущийОбъект = Выборка.Получить();
			Если ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.Партнеры") Тогда
				МассивПартнеров.Добавить(ТекущийОбъект.Ссылка);
			ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.смартУправлениеАкциями") Тогда
				МассивАкций.Добавить(ТекущийОбъект.Ссылка);
			КонецЕсли;
			
			Если МассивПартнеров.Количество() = КоличествоВВыгрузке Тогда
				СформироватьПакетПоМассивуПартнеровИВыгрузитьВбитрикс(Узел, МассивПартнеров);
				МассивПартнеров.Очистить();
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивПартнеров.Количество() > 0 Тогда
			СформироватьПакетПоМассивуПартнеровИВыгрузитьВбитрикс(Узел, МассивПартнеров);
			МассивПартнеров.Очистить();
		КонецЕсли;
		
		Если МассивАкций.Количество() > 0 Тогда
			СформироватьПакетПоМассивуАкцийИВыгрузитьВбитрикс(Узел, МассивАкций);
			МассивАкций.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПолучитьПартнераВерхнегоУровня(Партнер)
	
	Если Партнер.Родитель.Пустая() Тогда
		Возврат Партнер;
	КонецЕсли;
	
	Возврат ПолучитьПартнераВерхнегоУровня(Партнер.Родитель);
	
КонецФункции

Функция ПолучитьДанныеСкладаДляВыгрузкиВБитрикс(Склад) Экспорт
	
	Результат = Новый Структура("Склад,ВыгружатьНаСайт,НаименованиеНаСайте,АдресНаСайте,Наименование");
	
	Если ЗначениеЗаполнено(Склад) И ТипЗнч(Склад) = Тип("СправочникСсылка.Склады") И Склад.ЭтоГруппа Тогда
		
		Результат.Склад = Склад;
		Результат.ВыгружатьНаСайт = Склад.смартВыгружатьНаСайт;
		Результат.НаименованиеНаСайте = Склад.смартНаименованиеНаСайте;
		Результат.АдресНаСайте = Склад.смартАдресНаСайте;
		Результат.Наименование = Склад.Наименование;
		
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СкладысмартСкладыОстатковДляСайта.Ссылка КАК Склад,
		|	СкладысмартСкладыОстатковДляСайта.Ссылка.смартВыгружатьНаСайт КАК ВыгружатьНаСайт,
		|	СкладысмартСкладыОстатковДляСайта.Ссылка.смартНаименованиеНаСайте КАК НаименованиеНаСайте,
		|	СкладысмартСкладыОстатковДляСайта.Ссылка.смартАдресНаСайте КАК АдресНаСайте,
		|	СкладысмартСкладыОстатковДляСайта.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Склады.смартСкладыОстатковДляСайта КАК СкладысмартСкладыОстатковДляСайта
		|ГДЕ
		|	СкладысмартСкладыОстатковДляСайта.Склад = &Склад";
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьПакетПоМассивуПартнеровИВыгрузитьВбитрикс(Узел, МассивПартнеров)
	
	ДанныеДляВыгрузки = СформироватьДанныеДляВыгрузкиВБитрикс(МассивПартнеров, Узел);
		
	Результат = ПередатьПакетВБитрикс(Узел, ДанныеДляВыгрузки.Пользователи, "Пользователи", ДанныеДляВыгрузки);
	Если НЕ Результат = Истина Тогда
		ЗаписьЖурналаРегистрации("смартОбменССайтомБитриксСервер.ВыгрузкаПользователей", УровеньЖурналаРегистрации.Ошибка,,, Результат);
		Сообщить(Результат);
		Возврат;
	КонецЕсли;
	
	Результат = ПередатьПакетВБитрикс(Узел, ДанныеДляВыгрузки.Партнеры, "Партнеры", ДанныеДляВыгрузки);
	Если НЕ Результат = Истина Тогда
		ЗаписьЖурналаРегистрации("смартОбменССайтомБитриксСервер.ВыгрузкаПартнеров", УровеньЖурналаРегистрации.Ошибка,,, Результат);
		Сообщить(Результат);
		Возврат;
	КонецЕсли;
	
	Если МассивПартнеров.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, МассивПартнеров);
	КонецЕсли;
		
КонецПроцедуры

Процедура СформироватьПакетПоМассивуАкцийИВыгрузитьВбитрикс(Узел, МассивАкций)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Справочники.смартПредопределенныеЗначения.ОрганизацияБитрикс.Значение);
	Отбор.Вставить("ВозвращатьАкцииБудущего", Истина);
	
	ДанныеДляВыгрузки = смартАкцииИСкидки.ПолучитьДействующиеАкции(ТекущаяДата(), Отбор);
		
	Результат = ПередатьПакетВБитрикс(Узел, ДанныеДляВыгрузки, "Акции", ДанныеДляВыгрузки);
	Если НЕ Результат = Истина Тогда
		ЗаписьЖурналаРегистрации("смартОбменССайтомБитриксСервер.ВыгрузкаАкций", УровеньЖурналаРегистрации.Ошибка,,, Результат);
		Сообщить(Результат);
		Возврат;
	КонецЕсли;
	
	Если МассивАкций.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, МассивАкций);
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьТекущийСтатусЗаказаКлиентаНаСайте(ЗаказКлиента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СмартСтатусыЗаказовБитрикс.СтатусЗаказа КАК СтатусЗаказа
	|ИЗ
	|	РегистрСведений.СмартСтатусыЗаказовБитрикс КАК СмартСтатусыЗаказовБитрикс
	|ГДЕ
	|	СмартСтатусыЗаказовБитрикс.ГУИД = &ГУИД
	|	И СмартСтатусыЗаказовБитрикс.СсылкаМет = &СсылкаМет";
	
	Запрос.УстановитьПараметр("ГУИД", СокрЛП(ЗаказКлиента.УникальныйИдентификатор()));
	Запрос.УстановитьПараметр("СсылкаМет", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.СтатусЗаказа <> NULL Тогда
		Возврат Выборка.СтатусЗаказа;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПередатьНаСайтОтклонениеРегистрацииПользователя(ИДПользователя) Экспорт
	
	МассивОшибок = Новый Массив;
	
	МассивУзлов = ПолучитьМассивУзловОбменаБитрикс();
	
	Для каждого Узел Из МассивУзлов Цикл
		
		ДанныеПодключения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Узел, "АдресСайта,Логин,Пароль");
		
		АдресВнутри = "rest-api/v1/contacts/reject/";
		
		ДанныеJSON = смартОбщегоНазначения.ЗначениеВJSON(Новый Структура("userId", ИДПользователя));
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type",  "application/json");
		
		Результат = смартИнтеграцияDaData.ВыполнитьPOSTЗапрос(ДанныеПодключения.АдресСайта, АдресВнутри, 443, ДанныеПодключения.Логин, ДанныеПодключения.Пароль,,, Новый ЗащищенноеСоединениеOpenSSL(), Заголовки, ДанныеJSON);
		
		Если Результат <> Неопределено И НЕ Результат.КодСостояния = 200 Тогда
			МассивОшибок.Добавить(Результат.ПолучитьТелоКакСтроку());
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(МассивОшибок, Символы.ПС);
	
КонецФункции

#КонецОбласти
